#+TITLE: CHAPTER 3 exercises

** minimum 
#+BEGIN_SRC js :results output
    function min(a, b) {
	if( a <= b) {
	    return("a is smaller");
	}
	else {
	    return("b is smaller");
	}
    }
    console.log(min(7, 8));
  #+END_SRC

  #+RESULTS:
  : a is smaller
** recursion
    #+BEGIN_SRC js :results output
      function isEven(a){
	  if (a === 1){
	      return("a is odd");
	  }
	  else if(a === 0){
	      return("a is even");	      
	  }
	  else if (a < 0 ){
	      return isEven(a = -a);
	  }
	  else{
	      return isEven(a - 2);
	  }
      }
      console.log(isEven(9));
  #+END_SRC

  #+RESULTS:
  : a is odd

** bean counting
#+BEGIN_SRC js :results output
  function countBs(string, bean){
    let count = 0
      for(let i = 0; i < string.length; i++) {
	  if (string[i] === bean) {
	      count ++;  
	  }
	else count; 
      }
      return count;
  }
  console.log(countBs("jajajajarule", "j"));
console.log(countBs("kalvin campbell gha wai yu", "a"))
  #+END_SRC   

  #+RESULTS:
  : 4
  : 4
